import { SpellData } from '@components/ui/Additionals/Spell.tsx';

const lyra: SpellData[] = [
    {
        name: 'Починка',
        originalName: 'Mending',
        type: 'Заговор, трансмутація',
        casting_time: '1 хв',
        range: 'Дотик',
        components: 'В, С, М (два магнетити)',
        duration: 'Миттєва',
        description:
            'Це заклинання ремонтує одне пошкодження або розрив на предметі, якого ви торкаєтеся, наприклад, розірване ланцюгове кільце, дві половинки зламаного ключа, порваний плащ або протікаючий бурдюк. Якщо пошкодження або розрив не перевищує 1 фута в довжину, ви ремонтуєте його, не залишаючи слідів. Це заклинання може фізично відновити магічний предмет або конструкта, але не може відновити магію в таких предметах.',
    },
    {
        name: 'Фокуси',
        originalName: 'Prestidigitation',
        type: 'Заговор, трансмутація',
        casting_time: '1 дія',
        range: '10 футів',
        components: 'В, С',
        duration: 'До 1 години',
        description:
            'Це заклинання — невеликий магічний трюк, на якому практикуються початківці заклиначі.\nВи створюєте один з наступних магічних ефектів у межах дистанції:\n\n- Ви створюєте миттєвий нешкідливий сенсорний ефект, такий як спалах іскор, порив вітру, тиху мелодію або незвичайний запах.\n- Ви миттєво запалюєте або гасите свічку, факел або невелике вогнище.\n- Ви миттєво чистите або забруднюєте предмет, розміром не більше 1 кубічного фута.\n- Ви охолоджуєте, нагріваєте або надаєте запах 1 кубічному футу неживої матерії на 1 годину.\n- Ви створюєте на поверхні або предметі маленьку кольорову мітку або символ, що існує 1 годину.\n- Ви створюєте немагічну дрібничку або ілюзорний предмет, що поміщається у вашу долоню, і існує до кінця вашого наступного ходу.\n\nЯкщо ви накладаєте це заклинання декілька разів, ви можете мати не більше трьох немиттєвих ефектів одночасно, і можете дією завершити один з цих ефектів.',
    },
    {
        name: 'Холодний дотик',
        originalName: 'Chill Touch',
        type: 'Заговор, некромантія',
        casting_time: '1 дія',
        range: '120 футів',
        components: 'В, С',
        duration: '1 раунд',
        description:
            'Ви створюєте примарну руку скелета в просторі істоти, що знаходиться в межах дистанції. Здійсніть дальнобійну атаку заклинанням по істоті, щоб окутати її могильним холодом. При влучанні ціль отримує некротичний урон 1к8 і не може відновлювати хіти до початку вашого наступного ходу. Увесь цей час рука тримається за ціль.\n\nЯкщо ви влучаєте по нежиті, то вона замість цього до кінця вашого наступного ходу здійснює по вам кидки атаки з перешкодою.\n\nУрон цього заклинання збільшується на 1к8, коли ви досягаєте 5 рівня (2к8), 11 рівня (3к8) і 17 рівня (4к8).',
    },
    {
        name: 'Промінь Хвороби',
        originalName: 'Ray of Sickness',
        type: '1 рівень, некромантія',
        casting_time: '1 дія',
        range: '60 футів',
        components: 'В, С',
        duration: 'Миттєва',
        description:
            'Промінь нудотно-зеленої енергії спрямовується до істоти, що знаходиться в межах дистанції. Здійсніть дальнобійну атаку заклинанням по цілі. При влучанні ціль отримує урон отрутою 2к8 і повинна здійснити рятівний кидок Статури. При провалі вона також стає отруєною до кінця вашого наступного ходу.\n\nНа вищих рівнях: Якщо ви накладаєте це заклинання, використовуючи чарунку 2 рівня або вище, урон збільшується на 1к8 за кожен рівень чарунки вище першого.',
    },
    {
        name: 'Вогняні Долоні',
        originalName: 'Burning Hands',
        type: '1 рівень, втілення',
        casting_time: '1 дія',
        range: 'На себе (15-футовий конус)',
        components: 'В, С',
        duration: 'Миттєва',
        description:
            "З'єднавши долоні та розчепіривши пальці віялом, ви випускаєте з них тонкі язики полум'я. Усі істоти в межах 15-футового конуса повинні здійснити рятівні кидки Спритності. Істота отримує урон вогнем 3к6 у разі провалу та половину цього урону в разі успіху.\n\nПолум'я підпалює всі горючі предмети, які ніхто не несе та не носить.\n\nНа вищих рівнях: Якщо ви накладаєте це заклинання, використовуючи чарунку 2 рівня або вище, урон збільшується на 1к6 за кожен рівень чарунки вище першого.",
    },
    {
        name: 'Псевдожиття',
        originalName: 'False Life',
        type: '1 рівень, некромантія',
        casting_time: '1 дія',
        range: 'На себе',
        components:
            'В, С, М (невелика кількість алкоголю або дистильованого спирту)',
        duration: '1 година',
        description:
            'Зміцнивши себе некромантською подобою життя, ви отримуєте 1к4 + 4 тимчасових хита на час тривалості заклинання.\n\nНа вищих рівнях: Якщо ви накладаєте це заклинання, використовуючи чарунку 2 рівня або вище, ви отримуєте 5 додаткових тимчасових хитов за кожен рівень чарунки вище першого.',
    },
    {
        name: 'Кольорова Сфера',
        originalName: 'Chromatic Orb',
        type: '1 рівень, втілення',
        casting_time: '1 дія',
        range: '90 футів',
        components: 'В, С, М (діамант вартістю щонайменше 50 зм)',
        duration: 'Миттєва',
        description:
            'Ви кидаєте 4-дюймову (10-сантиметрову) сферу енергії в істоту, яку бачите в межах дистанції. Виберіть звук, кислоту, вогонь, холод, електрику або отруту при створенні сфери, а потім здійсніть по цілі дальнобійну атаку заклинанням. Якщо атака влучає, істота отримує урон 3к8 обраного виду.\n\nНа вищих рівнях: Якщо ви накладаєте це заклинання, використовуючи чарунку 2 рівня або вище, урон збільшується на 1к8 за кожен рівень чарунки вище першого.',
    },
    {
        name: 'Виявлення Магії',
        originalName: 'Detect Magic',
        type: '1 рівень, пророцтво (ритуал)',
        casting_time: '1 дія',
        range: 'На себе',
        components: 'В, С',
        duration: 'Концентрація, до 10 хв',
        description:
            "Поки заклинання активно, ви відчуваєте присутність магії в межах 30 футів. Якщо ви відчули за допомогою цього заклинання присутність магії, ви можете дією побачити слабку ауру навколо видимої істоти або предмета, що несе на собі магію, а також дізнатися школу цієї магії, якщо вона є.\n\nЗаклинання проникає крізь більшість бар'єрів, але блокується 1 футом каменю, 1 дюймом звичайного металу, тонким листом свинцю або 3 футами дерева чи землі.",
    },
    {
        name: 'Зачарування Особистості',
        originalName: 'Charm Person',
        type: '1 рівень, зачарування',
        casting_time: '1 дія',
        range: '30 футів',
        components: 'В, С',
        duration: '1 година',
        description:
            'Ви намагаєтеся зачарувати гуманоїда, якого бачите в межах дистанції. Він повинен здійснити рятівний кидок Мудрості, з перевагою, якщо ви або ваші супутники боретеся з ним. Якщо він провалює рятівний кидок, він зачарований вами, поки заклинання активне або поки ви або ваші супутники не завдасте йому шкоди. Зачарована істота вважає вас своїм другом. Коли заклинання закінчується, істота знає, що була зачарована вами.\n\nНа вищих рівнях: Якщо ви накладаєте це заклинання, використовуючи чарунку 2 рівня або вище, ви можете зробити ціллю одну додаткову істоту за кожен рівень чарунки вище першого. Ці істоти повинні знаходитися в межах 30 футів одна від одної, щоб ви могли на них націлитися.',
    },
    {
        name: 'Обладунки Мага',
        originalName: 'Mage Armor',
        type: '1 рівень, захист',
        casting_time: '1 дія',
        range: 'Дотик',
        components: 'В, С, М (шматочок обробленої шкіри)',
        duration: '8 годин',
        description:
            'Ви торкаєтеся згодної істоти, яка не носить обладунки, і на час дії заклинання її огортає захисне магічне поле. Базовий КД істоти стає рівним 13 + її модифікатор Спритності. Заклинання закінчується, якщо ціль одягає обладунки або ви закінчуєте його дією.',
    },
    {
        name: 'Маскування',
        originalName: 'Disguise Self',
        type: '1 рівень, ілюзія',
        casting_time: '1 дія',
        range: 'На себе',
        components: 'В, С',
        duration: '1 година',
        description:
            'Ви змушуєте себе — включаючи одяг, обладунки, зброю та інше майно — виглядати інакше, поки заклинання не закінчиться, або поки ви не закінчите його передчасно, дією. Ви можете виглядати на 1 фут (30 сантиметрів) вище або нижче, а також стати худим, товстим або отримати середню статуру. Ви не можете змінювати основу тіла, тому у нової форми має бути такий самий набір кінцівок. У всьому іншому характер ілюзії визначаєте ви.\n\nЗміни, викликані цим заклинанням, не витримують перевірку фізичним дослідженням. Наприклад, якщо ви додали до свого спорядження капелюх, предмети будуть проходити крізь нього, і всі, хто до нього торкнеться, або нічого не відчують, або відчують вашу голову і волосся. Якщо ви стаєте худішими, то рука того, хто до вас тягнеться, наткнеться на вас на півдорозі, ще в повітрі.\n\nДля виявлення того, що ви замасковані, істота повинна дією дослідити вашу зовнішність і досягти успіху в перевірці Інтелекту (Аналіз) проти вашої Сили заклинань.',
    },
];

const monti = [
    {
        name: 'Фокуси',
        originalName: 'Prestidigitation',
        type: 'Заговор, трансмутація',
        casting_time: '1 дія',
        range: '10 футів',
        components: 'В, С',
        duration: 'До 1 години',
        description:
            'Це заклинання — невеликий магічний трюк, на якому практикуються початківці заклиначі.\nВи створюєте один з наступних магічних ефектів у межах дистанції:\n\n- Ви створюєте миттєвий нешкідливий сенсорний ефект, такий як спалах іскор, порив вітру, тиху мелодію або незвичайний запах.\n- Ви миттєво запалюєте або гасите свічку, факел або невелике вогнище.\n- Ви миттєво чистите або забруднюєте предмет, розміром не більше 1 кубічного фута.\n- Ви охолоджуєте, нагріваєте або надаєте запах 1 кубічному футу неживої матерії на 1 годину.\n- Ви створюєте на поверхні або предметі маленьку кольорову мітку або символ, що існує 1 годину.\n- Ви створюєте немагічну дрібничку або ілюзорний предмет, що поміщається у вашу долоню, і існує до кінця вашого наступного ходу.\n\nЯкщо ви накладаєте це заклинання декілька разів, ви можете мати не більше трьох немиттєвих ефектів одночасно, і можете дією завершити один з цих ефектів.',
    },
    {
        name: 'Чарівна Рука',
        originalName: 'Mage Hand',
        type: 'Заговор, виклик',
        casting_time: '1 дія',
        range: '30 футів',
        components: 'В, С',
        duration: '1 хв',
        description:
            "У точці, вибраній вами в межах дистанції, з'являється примарна паруюча рука. Рука існує, поки заклинання активне, або поки ви не відпустите її дією. Рука зникає, якщо опиниться більш ніж за 30 футів від вас, або якщо ви повторно використаєте це заклинання.\n\nВи можете дією контролювати руку. Ви можете за її допомогою маніпулювати предметами, відкривати незамкнені двері та контейнери, прибирати предмети у відкриті контейнери та діставати їх звідти, або виливати вміст флаконів. При кожному використанні руки ви можете перемістити її на 30 футів.\n\nРука не може здійснювати атаки, активувати магічні предмети та переносити більше 10 фунтів.",
    },
    {
        name: 'Холодний дотик',
        originalName: 'Chill Touch',
        type: 'Заговор, некромантія',
        casting_time: '1 дія',
        range: '120 футів',
        components: 'В, С',
        duration: '1 раунд',
        description:
            'Ви створюєте примарну руку скелета в просторі істоти, що знаходиться в межах дистанції. Здійсніть дальнобійну атаку заклинанням по істоті, щоб окутати її могильним холодом. При влучанні ціль отримує некротичний урон 1к8 і не може відновлювати хіти до початку вашого наступного ходу. Увесь цей час рука тримається за ціль.\n\nЯкщо ви влучаєте по нежиті, то вона замість цього до кінця вашого наступного ходу здійснює по вам кидки атаки з перешкодою.\n\nУрон цього заклинання збільшується на 1к8, коли ви досягаєте 5 рівня (2к8), 11 рівня (3к8) і 17 рівня (4к8).',
    },
    {
        name: 'Обладунки Мага',
        originalName: 'Mage Armor',
        type: '1 рівень, захист',
        casting_time: '1 дія',
        range: 'Дотик',
        components: 'В, С, М (шматочок обробленої шкіри)',
        duration: '8 годин',
        description:
            'Ви торкаєтеся згодної істоти, яка не носить обладунки, і на час дії заклинання її огортає захисне магічне поле. Базовий КД істоти стає рівним 13 + її модифікатор Спритності. Заклинання закінчується, якщо ціль одягає обладунки або ви закінчуєте його дією.',
    },
    {
        name: 'Вогняні Долоні',
        originalName: 'Burning Hands',
        type: '1 рівень, втілення',
        casting_time: '1 дія',
        range: 'На себе (15-футовий конус)',
        components: 'В, С',
        duration: 'Миттєва',
        description:
            "З'єднавши долоні та розчепіривши пальці віялом, ви випускаєте з них тонкі язики полум'я. Усі істоти в межах 15-футового конуса повинні здійснити рятівні кидки Спритності. Істота отримує урон вогнем 3к6 у разі провалу та половину цього урону в разі успіху.\n\nПолум'я підпалює всі горючі предмети, які ніхто не несе та не носить.\n\nНа вищих рівнях: Якщо ви накладаєте це заклинання, використовуючи чарунку 2 рівня або вище, урон збільшується на 1к6 за кожен рівень чарунки вище першого.",
    },
    {
        name: 'Крижаний Ніж',
        originalName: 'Ice Knife',
        type: '1 круг, виклик',
        casting_time: '1 дія',
        range: '60 футів',
        components: 'С, М (крапля води або льодинка)',
        duration: 'Миттєво',
        description:
            'Ви створюєте уламок льоду і кидаєте його в одну істоту в радіусі дії. Здійсніть атаку далекого заклинання проти цілі. При влучанні ціль отримує 1d10 колючого урону. При влучанні або промаху уламок вибухає. Ціль і кожна істота в межах 5 футів від точки, де лід вибухнув, повинні успішно зробити рятівний кидок Спритності або отримати 2d6 урону холодом.\n\nНа вищих рівнях. Коли ви промовляєте це заклинання, використовуючи чарунку 2-го рівня або вище, урон холодом збільшується на 1d6 за кожен рівень чарунки вище 1-го.',
    },
    {
        name: 'Невидимий Слуга',
        originalName: 'Unseen Servant',
        type: '1 рівень, виклик (ритуал)',
        casting_time: '1 дія',
        range: '60 футів',
        components: 'В, С, М (частина тетиви і шматочок дерева)',
        duration: '1 година',
        description:
            "Це заклинання створює невидиму, несвідому і безформну силу, що виконує прості доручення, які ви їй віддаєте. Слуга з'являється у вільному просторі на землі в межах дистанції. У нього КД 10, 1 хіт, Сила 2, і він не може атакувати. Якщо його хіти опускаються до 0, заклинання закінчується.\n\nОдин раз у кожному своєму ході ви можете бонусною дією віддати команду слузі переміститися на 15 футів і здійснити маніпуляції з яким-небудь предметом. Слуга може виконувати прості завдання, доступні людині, такі як підношення предметів, чистка, ремонт і складання одягу, розпалювання вогню, подача їжі і розливання вина. Отримавши команду, слуга починає її виконувати, стараючись з усіх сил, поки не виконає, після чого починає чекати вашу наступну команду.\n\nЯкщо ви віддаєте слузі доручення, через яке той опиниться далі ніж у 60 футах від вас, заклинання закінчується.",
    },
    {
        name: 'Виявлення Магії',
        originalName: 'Detect Magic',
        type: '1 рівень, пророцтво (ритуал)',
        casting_time: '1 дія',
        range: 'На себе',
        components: 'В, С',
        duration: 'Концентрація, до 10 хв',
        description:
            "Поки заклинання активно, ви відчуваєте присутність магії в межах 30 футів. Якщо ви відчули за допомогою цього заклинання присутність магії, ви можете дією побачити слабку ауру навколо видимої істоти або предмета, що несе на собі магію, а також дізнатися школу цієї магії, якщо вона є.\n\nЗаклинання проникає крізь більшість бар'єрів, але блокується 1 футом каменю, 1 дюймом звичайного металу, тонким листом свинцю або 3 футами дерева чи землі.",
    },
    {
        name: 'Тензерів Літаючий Диск',
        originalName: "Tenser's Floating Disk",
        type: '1 рівень, виклик (ритуал)',
        casting_time: '1 дія',
        range: '30 футів',
        components: 'В, С, М (крапля ртуті)',
        duration: '1 година',
        description:
            'Це заклинання створює круглий горизонтальний диск із силового поля діаметром 3 фути і товщиною 1 дюйм (2,5 см), що літає в 3 футах над підлогою у вільному просторі на ваш вибір, видимому в межах дистанції. Диск існує, поки заклинання активне, і може витримати на собі 500 фунтів. Якщо на нього помістити більшу вагу, заклинання закінчиться, і все, що було на диску, впаде на підлогу.\n\nДиск нерухомий, поки ви знаходитесь в межах 20 футів від нього. Якщо ви переміститеся від нього на відстань, що перевищує 20 футів, диск слідує за вами, залишаючись в межах 20 футів. Він може перелітати по нерівній поверхні, переміщатися по сходах, схилах і подібних перешкодах, але не може перетинати перепади по висоті в 10 футів і більше. Наприклад, диск не зможе перелетіти над 10-футовою ямою і не зможе з неї вибратися, якщо буде створений на її дні.\n\nЯкщо ви переміститеся більш ніж на 100 футів від диска (наприклад, якщо він через перешкоду не зможе слідувати за вами), заклинання закінчиться.',
    },
    {
        name: 'Маскування',
        originalName: 'Disguise Self',
        type: '1 рівень, ілюзія',
        casting_time: '1 дія',
        range: 'На себе',
        components: 'В, С',
        duration: '1 година',
        description:
            'Ви змушуєте себе — включаючи одяг, обладунки, зброю та інше майно — виглядати інакше, поки заклинання не закінчиться, або поки ви не закінчите його передчасно, дією. Ви можете виглядати на 1 фут (30 сантиметрів) вище або нижче, а також стати худим, товстим або отримати середню статуру. Ви не можете змінювати основу тіла, тому у нової форми має бути такий самий набір кінцівок. У всьому іншому характер ілюзії визначаєте ви.\n\nЗміни, викликані цим заклинанням, не витримують перевірку фізичним дослідженням. Наприклад, якщо ви додали до свого спорядження капелюх, предмети будуть проходити крізь нього, і всі, хто до нього торкнеться, або нічого не відчують, або відчують вашу голову і волосся. Якщо ви стаєте худішими, то рука того, хто до вас тягнеться, наткнеться на вас на півдорозі, ще в повітрі.\n\nДля виявлення того, що ви замасковані, істота повинна дією дослідити вашу зовнішність і досягти успіху в перевірці Інтелекту (Аналіз) проти вашої Сили заклинань.',
    },
    {
        name: 'Ковзання',
        originalName: 'Grease',
        type: '1 рівень, виклик',
        casting_time: '1 дія',
        range: '60 футів',
        components: 'В, С, М (шматок масла або свинячого сала)',
        duration: '1 хв',
        description:
            "Слизький жир покриває підлогу в квадраті зі стороною 10 футів з центром у точці в межах дистанції, роблячи цю місцевість важкопрохідною, поки заклинання активне.\n\nКоли жир з'являється, всі істоти, що стоять у цій області, повинні успішно зробити рятівний кидок Спритності, інакше вони падають ниць. Істоти, що входять у цю область або закінчують там хід, також повинні успішно зробити рятівний кидок Спритності, щоб не впасти.",
    },
];

const print = [
    {
        name: 'Невидимість',
        originalName: 'Invisibility',
        type: '2 рівень, ілюзія',
        casting_time: '1 дія',
        range: 'Дотик',
        components: 'В, С, М (вія, закріплена в гумі арабік)',
        duration: 'Концентрація, до 1 години',
        description:
            'Істота, до якої ви торкаєтеся, стає невидимою до закінчення заклинання. Все, що ціль носить або тримає, також стає невидимим, поки це знаходиться на цілі. Заклинання закінчується для цілі, яка атакує або накладає заклинання.\n\nНа вищих рівнях. Коли ви накладаєте це заклинання, використовуючи чарунку 3-го рівня або вище, ви можете обрати одну додаткову істоту за кожен рівень чарунки вище 2-го.',
    },
    {
        name: 'Чудотворство',
        originalName: 'Thaumaturgy',
        type: 'Заговор, трансмутація',
        casting_time: '1 дія',
        range: '30 футів',
        components: 'В',
        duration: 'До 1 хвилини',
        description:
            "Ви створюєте невелике чудо, знак надприродної сили. Ви створюєте один з наступних магічних ефектів у межах дистанції:\n\n- Ваш голос протягом 1 хвилини звучить у три рази голосніше.\n- Ви змушуєте полум'я протягом 1 хвилини мерехтіти, світити яскравіше або тьмяніше, або змінювати колір.\n- Ви викликаєте нешкідливу дріж у землі протягом 1 хвилини.\n- Ви створюєте миттєвий звук, що виходить з обраної вами точки в межах дистанції, такий як гуркіт грому, крик ворона або зловісний шепіт.\n- Ви миттєво змушуєте незамкнене вікно або двері розчинитися або захлопнутися.\n- Ви на 1 хвилину змінюєте зовнішній вигляд своїх очей.\n\nЯкщо ви накладаєте це заклинання кілька разів, у вас може бути до трьох активних ефектів з тривалістю в 1 хвилину, і ви можете завершувати такі ефекти дією.",
    },
    {
        name: 'Пекельна Відплата',
        originalName: 'Hellish Rebuke',
        type: '1 рівень, втілення',
        casting_time:
            '1 реакція, здійснювана вами у відповідь на отримання урону від істоти, що знаходиться в межах 60 футів від вас і видима вами',
        range: '60 футів',
        components: 'В, С',
        duration: 'Миттєво',
        description:
            "Ви вказуєте пальцем, і істота, що спричинила вам урон, миттєво оточується полум'ям. Істота повинна здійснити рятівний кидок Спритності. Вона отримує урон вогнем 2к10 при провалі, або половину цього урону при успіху.\n\nНа вищих рівнях. Якщо ви накладаєте це заклинання, використовуючи чарунку 2 рівня або вище, урон збільшується на 1к10 за кожен рівень чарунки вище першого.",
    },
    {
        name: 'Беззвучне Зображення',
        originalName: 'Silent Image',
        type: '1 рівень, ілюзія',
        casting_time: '1 дія',
        range: '60 футів',
        components: 'В, С, М (шматок флісу)',
        duration: 'Концентрація, до 10 хвилин',
        description:
            "Ви створюєте зображення об'єкта, істоти або якогось іншого видимого явища, яке не більше ніж 15-футовий куб. Зображення з'являється в точці в межах дистанції і триває протягом заклинання. Зображення є чисто візуальним; воно не супроводжується звуком, запахом або іншими сенсорними ефектами.\n\nВи можете використовувати свою дію, щоб змусити зображення переміститися в будь-яку точку в межах дистанції. Коли зображення змінює місце розташування, ви можете змінити його зовнішній вигляд, щоб його рухи здавалися природними для зображення. Наприклад, якщо ви створюєте зображення істоти і переміщуєте його, ви можете змінити зображення так, щоб здавалось наче воно йде.\n\nФізична взаємодія із зображенням виявляє його як ілюзію, бо речі можуть проходити через нього. Істота, яка використовує свою дію для дослідження зображення, може визначити, що це ілюзія, успішно зробивши перевірку Інтелекту проти вашого КС заклинання. Якщо істота розпізнає ілюзію, вона може бачити крізь зображення.",
    },
    {
        name: 'Визначення',
        originalName: 'Identify',
        type: '1 рівень, ворожіння (ритуал)',
        casting_time: '1 хвилина',
        range: 'Дотик',
        components: 'В, С, М (перлина вартістю не менше 100 зм і перо сови)',
        duration: 'Миттєво',
        description:
            "Ви обираєте один об'єкт, який повинні торкатися протягом всього накладання заклинання. Якщо це магічний предмет або інший об'єкт, насичений магією, ви дізнаєтеся його властивості та як їх використовувати, чи вимагає він налаштування для використання, і скільки зарядів він має, якщо є. Ви дізнаєтеся, чи впливають на предмет якісь заклинання і які саме. Якщо предмет був створений заклинанням, ви дізнаєтеся, яке заклинання його створило.\n\nЯкщо замість цього ви торкаєтеся істоти протягом накладання, ви дізнаєтеся, які заклинання, якщо такі є, наразі впливають на неї.",
    },
    {
        name: 'Збільшення/Зменшення',
        originalName: 'Enlarge/Reduce',
        type: '2 рівень, трансмутація',
        casting_time: '1 дія',
        range: '30 футів',
        components: 'В, С',
        duration: 'Концентрація, до 1 хвилини',
        description:
            "Ви змушуєте істоту або об'єкт, який ви бачите в межах дистанції, збільшитися або зменшитися на тривалість заклинання. Оберіть або істоту, або об'єкт, який не носиться і не переноситься. Якщо ціль не бажає цього, вона може здійснити рятівний кидок Статури. При успіху заклинання не має ефекту.\n\nЯкщо ціль є істотою, все, що вона носить і переносить, змінює розмір разом з нею. Будь-який предмет, який скидає зачарована істота, миттєво повертається до нормального розміру.\n\nЗбільшення. Розмір цілі подвоюється у всіх вимірах, і її вага збільшується вісім разів. Це зростання збільшує її розмір на одну категорію — наприклад, від Середнього до Великого. Якщо недостатньо місця для подвоєння розміру цілі, істота або об'єкт досягають максимально можливого розміру в доступному просторі. Поки заклинання триває, ціль також має перевагу на перевірки Сили та рятівні кидки Сили. Зброя цілі також зростає, щоб відповідати її новому розміру. Поки ця зброя збільшена, атаки цілі з нею завдають додатковий урон 1d4.\n\nЗменшення. Розмір цілі зменшується наполовину у всіх вимірах, і її вага зменшується до однієї восьмої від нормальної. Це зменшення зменшує її розмір на одну категорію — наприклад, від Середнього до Малого. Поки заклинання триває, ціль також має недолік на перевірки Сили та рятівні кидки Сили. Зброя цілі також зменшується, щоб відповідати її новому розміру. Поки ця зброя зменшена, атаки цілі з нею завдають на 1d4 менше урону (це не може зменшити урон нижче 1).",
    },
    {
        name: 'Стук',
        originalName: 'Knock',
        type: '2 рівень, трансмутація',
        casting_time: '1 дія',
        range: '60 футів',
        components: 'В',
        duration: 'Миттєво',
        description:
            "Оберіть об'єкт, який ви бачите в межах дистанції. Об'єкт може бути дверима, коробкою, скринею, набором кайданів, навісним замком або іншим об'єктом, який містить звичайні або магічні засоби, що перешкоджають доступу.\n\nЦіль, яка утримується закритою звичайним замком або яка застрягла чи забарикадована, стає відкритою, розблокованою або незабарикадованою. Якщо об'єкт має кілька замків, лише один з них відкривається.\n\nЯкщо ви обираєте ціль, яка утримується закритою за допомогою арканного замка, це заклинання пригнічується на 10 хвилин, протягом яких ціль можна відкрити і закрити звичайним чином.\n\nКоли ви накладаєте це заклинання, з об'єкта цілі лунає гучний стук, чутний на відстані до 300 футів.",
    },
    {
        name: 'Чарівний Рот',
        originalName: 'Magic Mouth',
        type: '2 рівень, ілюзія (ритуал)',
        casting_time: '1 хвилина',
        range: '30 футів',
        components:
            'В, С, М (мед і пил нефриту вартістю не менше 10 зм, які заклинання споживає)',
        duration: 'До розсіювання',
        description:
            "Ви вбудовуєте повідомлення в об'єкт у межах дистанції, повідомлення, яке виголошується, коли виконуються умови тригера. Оберіть об'єкт, який ви бачите і який не носиться і не переноситься іншою істотою. Потім вимовте повідомлення, яке має бути не більше 25 слів, хоча його можна передавати протягом до 10 хвилин. Нарешті, визначте обставини, які спровокують заклинання виголосити ваше повідомлення.\n\nКоли ці обставини виникають, на об'єкті з'являється магічний рот і виголошує повідомлення вашим голосом і на тому ж рівні гучності, з яким ви говорили. Якщо обраний вами об'єкт має рот або щось, що виглядає як рот (наприклад, рот статуї), магічний рот з'являється там, щоб слова з'являлися з рота об'єкта. Коли ви накладаєте це заклинання, ви можете вказати, щоб заклинання закінчилося після виголошення повідомлення, або воно може залишатися і повторювати повідомлення щоразу, коли виникає тригер.\n\nОбставини тригера можуть бути загальними або детальними, як вам заманеться, хоча вони повинні базуватися на візуальних або звукових умовах, що виникають у межах 30 футів від об'єкта. Наприклад, ви можете вказати роту говорити, коли будь-яка істота наближається на 30 футів до об'єкта або коли срібний дзвін дзвонить у межах 30 футів від нього.",
    },
    {
        name: 'Фокус з Мотузкою',
        originalName: 'Rope Trick',
        type: '2 рівень, трансмутація',
        casting_time: '1 дія',
        range: 'Дотик',
        components:
            'В, С, М (порошкоподібний екстракт кукурудзи і скручена петля з пергаменту)',
        duration: '1 година',
        description:
            'Ви торкаєтеся мотузки довжиною до 60 футів. Один кінець мотузки піднімається в повітря, поки вся мотузка не висить перпендикулярно до землі. На верхньому кінці мотузки відкривається невидимий вхід у позарозмірний простір, який триває до закінчення заклинання.\n\nДо позарозмірного простору можна дістатися, піднявшись на верх мотузки. Простір може вмістити до восьми Середніх або менших істот. Мотузку можна втягнути в простір, зробивши мотузку невидимою ззовні простору.\n\nАтаки і заклинання не можуть перетинати вхід у позарозмірний простір або виходити з нього, але ті, хто всередині, можуть бачити зовні, як через вікно розміром 3 фути на 5 футів, розташоване по центру мотузки.\n\nВсе, що знаходиться всередині позарозмірного простору, випадає назовні, коли заклинання закінчується.',
    },
    {
        name: 'Формування Води',
        originalName: 'Shape Water',
        type: 'Заговор, трансмутація',
        casting_time: '1 дія',
        range: '30 футів',
        components: 'С',
        duration: 'Миттєво або 1 година (див. нижче)',
        description:
            "Ви обираєте ділянку води, яку ви бачите в межах дистанції і яка поміщається в 5-футовий куб. Ви маніпулюєте нею одним з наступних способів:\n\n- Ви миттєво переміщуєте або іншим чином змінюєте потік води за вашим напрямом, до 5 футів в будь-якому напрямку. Цей рух не має достатньої сили, щоб завдати шкоди.\n- Ви змушуєте воду формуватися в прості форми і анімуватися за вашим напрямом. Ця зміна триває 1 годину.\n- Ви змінюєте колір або непрозорість води. Вода повинна бути змінена однаково по всьому об'єму. Ця зміна триває 1 годину.\n- Ви заморожуєте воду, за умови, що в ній немає істот. Вода розморожується через 1 годину.\n\nЯкщо ви накладаєте це заклинання кілька разів, ви можете мати не більше двох його немиттєвих ефектів активними одночасно, і ви можете припинити такий ефект як дію.",
    },
    {
        name: 'Створення Вогнища',
        originalName: 'Create Bonfire',
        type: 'Заговор, виклик',
        casting_time: '1 дія',
        range: '60 футів',
        components: 'В, С',
        duration: 'Концентрація, до 1 хвилини',
        description:
            "Ви створюєте вогнище на землі, яку ви бачите в межах дистанції. Поки заклинання триває, магічне вогнище заповнює куб розміром 5 футів. Будь-яка істота в просторі вогнища, коли ви накладаєте заклинання, повинна успішно здійснити рятівний кидок Спритності або отримати 1d8 урону вогнем. Істота також повинна зробити рятівний кидок, коли вперше переміщується в простір вогнища на ходу або закінчує свій хід там.\n\nВогнище запалює легкозаймисті об'єкти в своїй області, які не носяться і не переносяться.\n\nУрон заклинання збільшується на 1d8, коли ви досягаєте 5-го рівня (2d8), 11-го рівня (3d8) і 17-го рівня (4d8).",
    },
];

// export const spells = monti.filter(
//     (spell) => !lyra.find((lyraSpell) => lyraSpell.name === spell.name),
// );
export const spells = print;
